app/views/shared/_category_src.html.erb

SELECT "categories".* FROM "categories"
---
            </li>
            <% Category.all.each do |category| %>