app/controllers/posts_controller.rb

  def index
    if params[:category].blank?
      @posts = Post.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @posts = Post.where(category_id: @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Sustainable Home"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY created_at DESC  [["category_id", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "category_id", "created_at", "updated_at", "attachments", "lead", "author", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = $1, "attachments" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["image", "tooth.jpg"], ["attachments", "[\"IMG_4591.jpg\"]"], ["updated_at", "2019-06-17 19:13:05.984987"], ["id", 3]]

  def home
    @posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC