app/controllers/registrations_controller.rb

    def one_user_registered?
      if User.count == 1
---
SELECT COUNT(*) FROM "users"